In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
# Series and DataFrame module used alot so we import them to our local namespace
from pandas import Series,DataFrame

In [4]:
import matplotlib.pyplot as plt

In [5]:
# THERE ARE 2 DATA STRUCTURES (SERIES , DATAFRAMES)

In [5]:
#Series
rng=np.random.default_rng(seed=43)
sr=Series(rng.integers(10,20,5))

In [19]:
sr

0    15
1    16
2    14
3    10
4    15
dtype: int64

In [20]:
type(sr)

pandas.core.series.Series

In [9]:
sr.index # gives info about indexing

RangeIndex(start=0, stop=5, step=1)

In [10]:
sr

0    10
1    17
2    16
3    14
4    14
dtype: int64

In [21]:
sr.array # gives info about values

<PandasArray>
[15, 16, 14, 10, 15]
Length: 5, dtype: int64

In [24]:
# often index is spesified with label by us 
sr.index=['a','b','c','d','e']
sr

a    15
b    16
c    14
d    10
e    15
dtype: int64

In [15]:
# series are very similar to dictionaries
#expect vide variety of numerical operations like...
np.exp(sr)

a    2.202647e+04
b    2.415495e+07
c    8.886111e+06
d    1.202604e+06
e    1.202604e+06
dtype: float64

In [24]:
# series can be converted to dict`s and vise versa
dct=sr.to_dict()
dct

{'a': 10, 'b': 17, 'c': 16, 'd': 14, 'e': 14}

In [37]:
# dual series operations acts like join , operation calculated when there is data for both index
exp_sr=np.exp(sr)
exp_sr['a']=pd.NA
exp_sr*sr #LIKE INNER JOIN

a             NaN
b    4.106342e+08
c    1.421778e+08
d    1.683646e+07
e    1.683646e+07
dtype: float64

In [ ]:
# DataFrame
#can be thought as appended series that has same index

In [51]:
#most commonly created via dictionary of same size arrays
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df=DataFrame(data)

In [52]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [53]:
# HEAD method displays first 5 row for understanding the data
df.head()+df.tail()

          state    year  pop
0           NaN     NaN  NaN
1      OhioOhio  4002.0  3.4
2      OhioOhio  4004.0  7.2
3  NevadaNevada  4002.0  4.8
4  NevadaNevada  4004.0  5.8
5           NaN     NaN  NaN

In [54]:
# DataFrame can be converted to series by using [] or dot convention
df.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [55]:
df['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [73]:
df['debt']=np.nan

In [81]:
df

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9   NaN
5  Nevada  2003  3.2   NaN

In [82]:
del df['debt'] #can remove colums

In [83]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [85]:
#NESTED DICTIONARYS FOR CREATING A DATAFRAME df={col_name :{index:value,index:value}}
data={'game':{'best':'chess','worst':'squich'},
    'rating':{'best':10,'worst':2,'middle':5}}
df=DataFrame(data)
df

          game  rating
best     chess      10
worst   squich       2
middle     NaN       5

In [25]:
# index object (they are immutable for safety procations)
indx=pd.Index(np.arange(5,8))
exam=Series(('a','b','c'),index=indx)
exam

5    a
6    b
7    c
dtype: object

In [6]:
# index operation can be interrogated like sets
5 in exam.index, 1632 in exam.index

(True, False)

In [7]:
#THIS PROPERTY STANDS FOR COLUMNS(DataFrame),array(Series ) TYPE 
'a' in exam.array

True

In [27]:
exam=Series(np.where(exam.isin(['a','c']),exam,0))

In [28]:
exam

0    a
1    0
2    c
dtype: object

In [ ]:
# FUNCTIONALITIES FOR PANDAS #

In [6]:
rng=np.random.default_rng(seed=3985)

In [25]:
#reindex

#series example
sr=Series(['a','c','d'],index=[0,2,4])
sr.reindex(np.arange(6)),sr.reindex(np.arange(6),method='ffill')
                                    #original indexing effected the method:if 1,2,3->acdddd,0,2,4>aaccdd)

(0      a
 1    NaN
 2      c
 3    NaN
 4      d
 5    NaN
 dtype: object,
 0    a
 1    a
 2    c
 3    c
 4    d
 5    d
 dtype: object)

In [27]:
#REINDEX ON DataFrame
df=DataFrame(rng.normal(100,60,size=(10,4)),
            index=['s1','s2','s3','s4','s5','s6','s7','s8','s9','s10'],
            columns=['price','crime',"school",'hospitality'])
df

          price       crime      school  hospitality
s1    45.479613  -19.510293  158.297379   100.999438
s2   112.343881   52.984307  173.589882   156.592035
s3    92.690567   66.648193   78.598517    52.082467
s4   101.593849   63.029937  135.132551    78.431886
s5    78.762576  192.235180   56.456829     5.925047
s6   121.972912  -24.672111  115.862718   158.903209
s7   104.206902  100.556504  -23.036561   133.318221
s8   123.777554   29.680134  214.790245    26.559028
s9    -0.757422   -8.663466  101.558254   120.272275
s10  126.458435   79.758401   51.239499   150.565875

In [30]:
df.index

Index(['s1', 's2', 's3', 's4', 's5', 's6', 's7', 's8', 's9', 's10'], dtype='object')

In [18]:
df.reindex(index=(df.index).union(['s7']))

          price       crime      school  hospitality
s1   156.433883  -17.062111   21.869230   107.670424
s10  139.035567  144.595250  132.589256    60.069418
s2    81.025444   98.991931   48.817364   152.763878
s3   146.667516  103.961842  167.634472   128.050561
s4    48.442452  122.125047   42.467044   152.707018
s5    97.004445   88.908258   59.144227   173.352480
s6    90.728231   74.300331   78.871987   131.938551
s7   121.926644  124.763957  125.849260   228.498856
s8    75.615099   69.265436   51.173636   136.958765
s9   167.738338   93.163153   49.590611    50.531127

In [9]:
columns=['school','childcare']
df.reindex(columns=columns),'OR SAME AS',df.reindex(columns,axis='columns')

(         school  childcare
 s1   120.815104        NaN
 s2    89.202286        NaN
 s3   -41.762077        NaN
 s4   126.421996        NaN
 s5    95.035462        NaN
 s6    -8.715328        NaN
 s7   123.103220        NaN
 s8    94.702824        NaN
 s9    25.642099        NaN
 s10   15.281876        NaN,
 'OR SAME AS',
          school  childcare
 s1   120.815104        NaN
 s2    89.202286        NaN
 s3   -41.762077        NaN
 s4   126.421996        NaN
 s5    95.035462        NaN
 s6    -8.715328        NaN
 s7   123.103220        NaN
 s8    94.702824        NaN
 s9    25.642099        NaN
 s10   15.281876        NaN)

In [10]:
# !!IF YOU DONT WANNA CREATE NEW INDEX .LOC IS MORE CONVENIENT WAY TO REINDEX
df.loc[['s1','s5',"s7"],['school','hospitality']]

        school  hospitality
s1  120.815104    92.010211
s5   95.035462   125.526171
s7  123.103220    80.109065

In [11]:
#DROPPING ENTRIES FROM AN AXIS
string='p i l l o w'
index=string.split()
vals=np.arange(6)
sr=Series(vals,index)

In [12]:
sr

p    0
i    1
l    2
l    3
o    4
w    5
dtype: int64

In [13]:
sr=sr.drop('p')
sr

i    1
l    2
l    3
o    4
w    5
dtype: int64

In [14]:
#DROPPING FOR DataFrame
df

          price       crime      school  hospitality
s1    89.949024  140.610650  120.815104    92.010211
s2    78.282433  131.969262   89.202286    22.049377
s3    91.821126   98.846105  -41.762077   176.710293
s4    44.009273   10.045141  126.421996    -7.805860
s5    -2.801062  221.935191   95.035462   125.526171
s6    21.052535  186.801559   -8.715328   135.179557
s7   134.889549  197.980834  123.103220    80.109065
s8   124.569911  125.947355   94.702824    -0.737916
s9   112.621382  114.222448   25.642099   143.498171
s10   97.513695  146.857241   15.281876    63.540401

In [18]:
df.drop('crime',axis=1)

          price      school  hospitality
s1    89.949024  120.815104    92.010211
s2    78.282433   89.202286    22.049377
s3    91.821126  -41.762077   176.710293
s4    44.009273  126.421996    -7.805860
s5    -2.801062   95.035462   125.526171
s6    21.052535   -8.715328   135.179557
s7   134.889549  123.103220    80.109065
s8   124.569911   94.702824    -0.737916
s9   112.621382   25.642099   143.498171
s10   97.513695   15.281876    63.540401

In [19]:
# loc[], and iloc[]
# loc[] can work with columns or integer`s value not its index
# iloc[] is for like python,numpy arrays integer location  
sr

i    1
l    2
l    3
o    4
w    5
dtype: int64

In [61]:
sr.loc['l']

l    2
l    3
dtype: int64

In [25]:
sr.iloc[[2,3,2]]

l    3
o    4
l    3
dtype: int64

In [32]:
#loc,iloc uses square brackets for indicing property
sr.iloc[2:5]

l    3
o    4
w    5
dtype: int64

In [66]:
#indexing with dataframe
df

          price       crime      school  hospitality
s1    89.949024  140.610650  120.815104    92.010211
s2    78.282433  131.969262   89.202286    22.049377
s3    91.821126   98.846105  -41.762077   176.710293
s4    44.009273   10.045141  126.421996    -7.805860
s5    -2.801062  221.935191   95.035462   125.526171
s6    21.052535  186.801559   -8.715328   135.179557
s7   134.889549  197.980834  123.103220    80.109065
s8   124.569911  125.947355   94.702824    -0.737916
s9   112.621382  114.222448   25.642099   143.498171
s10   97.513695  146.857241   15.281876    63.540401

In [43]:
df[df['school']>50]

         price       crime      school  hospitality
s1   89.949024  140.610650  120.815104    92.010211
s2   78.282433  131.969262   89.202286    22.049377
s4   44.009273   10.045141  126.421996    -7.805860
s5   -2.801062  221.935191   95.035462   125.526171
s7  134.889549  197.980834  123.103220    80.109065
s8  124.569911  125.947355   94.702824    -0.737916

In [48]:
df[:2] #df[2] without slicing [], only works with colums ,but ':' switches the working to rows

        price       crime      school  hospitality
s1  89.949024  140.610650  120.815104    92.010211
s2  78.282433  131.969262   89.202286    22.049377

In [40]:
df['price']

s1      42.903635
s2      39.395059
s3      58.680067
s4      66.264482
s5     147.295975
s6     159.218709
s7      67.004292
s8      70.274771
s9      62.569513
s10     52.710127
Name: price, dtype: float64

In [52]:
# loc iloc for DataFrame 
df.loc[['s2','s7'],['school','price']]

        school       price
s2   89.202286   78.282433
s7  123.103220  134.889549

In [60]:
df.iloc[1:3]

        price       crime     school  hospitality
s2  78.282433  131.969262  89.202286    22.049377
s3  91.821126   98.846105 -41.762077   176.710293

In [70]:
df.loc[:'s6','crime']       #some examples

s1    140.610650
s2    131.969262
s3     98.846105
s4     10.045141
s5    221.935191
s6    186.801559
Name: crime, dtype: float64

In [85]:
df1=df.loc['s1',:'school']
df2=df.loc['s2']

In [91]:
df1+df2

crime          272.579912
hospitality           NaN
price          168.231458
school         210.017390
dtype: float64

In [92]:
df1.add(df2,fill_value=23453) #helps with complemantery part

crime            272.579912
hospitality    23475.049377
price            168.231458
school           210.017390
dtype: float64

In [93]:
#DataFrame&Series operations have broadcastion property on Series
df

          price       crime      school  hospitality
s1    89.949024  140.610650  120.815104    92.010211
s2    78.282433  131.969262   89.202286    22.049377
s3    91.821126   98.846105  -41.762077   176.710293
s4    44.009273   10.045141  126.421996    -7.805860
s5    -2.801062  221.935191   95.035462   125.526171
s6    21.052535  186.801559   -8.715328   135.179557
s7   134.889549  197.980834  123.103220    80.109065
s8   124.569911  125.947355   94.702824    -0.737916
s9   112.621382  114.222448   25.642099   143.498171
s10   97.513695  146.857241   15.281876    63.540401

In [97]:
df1

price      89.949024
crime     140.610650
school    120.815104
Name: s1, dtype: float64

In [99]:
df-df1*1000 #copied the series for each row

             crime  hospitality         price         school
s1  -140470.039412          NaN -89859.075432 -120694.289330
s2  -140478.680800          NaN -89870.742023 -120725.902149
s3  -140511.803957          NaN -89857.203330 -120856.866511
s4  -140600.604921          NaN -89905.015183 -120688.682439
s5  -140388.714871          NaN -89951.825518 -120720.068972
s6  -140423.848503          NaN -89927.971921 -120823.819762
s7  -140412.669228          NaN -89814.134907 -120692.001214
s8  -140484.702707          NaN -89824.454546 -120720.401611
s9  -140496.427614          NaN -89836.403075 -120789.462336
s10 -140463.792820          NaN -89851.510761 -120799.822558

In [100]:
crime=df['crime']

In [112]:
crime

s1     140.610650
s2     131.969262
s3      98.846105
s4      10.045141
s5     221.935191
s6     186.801559
s7     197.980834
s8     125.947355
s9     114.222448
s10    146.857241
Name: crime, dtype: float64

In [114]:
df.sub(crime,axis='index')# without axis it would have

          price  crime      school  hospitality
s1   -50.661626    0.0  -19.795546   -48.600439
s2   -53.686829    0.0  -42.766976  -109.919885
s3    -7.024978    0.0 -140.608181    77.864188
s4    33.964132    0.0  116.376854   -17.851001
s5  -224.736252    0.0 -126.899728   -96.409019
s6  -165.749024    0.0 -195.516887   -51.622002
s7   -63.091285    0.0  -74.877613  -117.871769
s8    -1.377444    0.0  -31.244531  -126.685271
s9    -1.601066    0.0  -88.580349    29.275723
s10  -49.343547    0.0 -131.575365   -83.316840

In [15]:
sr

0    15
1    16
2    14
3    10
4    15
dtype: int64

In [17]:
sr.index=('a b c d e').split()

In [22]:
sr[[1,4]]

b    16
e    15
dtype: int64

In [28]:
df

          price       crime      school  hospitality
s1    45.479613  -19.510293  158.297379   100.999438
s2   112.343881   52.984307  173.589882   156.592035
s3    92.690567   66.648193   78.598517    52.082467
s4   101.593849   63.029937  135.132551    78.431886
s5    78.762576  192.235180   56.456829     5.925047
s6   121.972912  -24.672111  115.862718   158.903209
s7   104.206902  100.556504  -23.036561   133.318221
s8   123.777554   29.680134  214.790245    26.559028
s9    -0.757422   -8.663466  101.558254   120.272275
s10  126.458435   79.758401   51.239499   150.565875

In [37]:
sr=df['price']

In [39]:
sr

s1      45.479613
s2     112.343881
s3      92.690567
s4     101.593849
s5      78.762576
s6     121.972912
s7     104.206902
s8     123.777554
s9      -0.757422
s10    126.458435
Name: price, dtype: float64

In [43]:
df.sub(sr,axis='index')

     price       crime      school  hospitality
s1     0.0  -64.989905  112.817766    55.519825
s2     0.0  -59.359573   61.246001    44.248154
s3     0.0  -26.042375  -14.092050   -40.608100
s4     0.0  -38.563912   33.538702   -23.161963
s5     0.0  113.472604  -22.305748   -72.837529
s6     0.0 -146.645022   -6.110193    36.930297
s7     0.0   -3.650397 -127.243463    29.111319
s8     0.0  -94.097420   91.012691   -97.218526
s9     0.0   -7.906044  102.315676   121.029697
s10    0.0  -46.700033  -75.218936    24.107440